'''
开发方向：
属性：AI、用户的印象及其属性
====可能需要固定属性和可变属性，比如：地点、心情、时间等等
'''

# 参考属性，可以拓展
personality_s = ['自信', '害羞', '善良', '自私', '天真', '愤世嫉俗', '勇敢', '懦弱', '好色', '纯洁', '拘谨', '口齿不清',
                 '口吃', '发音模糊']

sex_knowledge_s = ['']
heads = ['']
mouths = ['']
hair = ['无发型', '中分', '凌乱', '卷发', '直发', '背头', '髻发', '丸子头', '波浪头', '马尾辫', '低马尾', '双马尾',
        '双低马尾', '侧麻花辫', '麻花辫', '双麻花辫', '公主切']
hair_lengths = ['光头', '寸头', '及胸', '及腰', '过膝']
necks = ['']
hands = ['']
body_s = ['']
feet = ['']
socks = ['']
top_clothes = ['']
lower_clothes = ['']
top_underwear_s = ['']
lower_underwear_s = ['']
packets = ['']
bags = ['']
labels = ['']
careers = ['无业游民', '蓝领', '学生', '白领', '音乐家', '画家', '教师', '作家', '厨师', '建筑工人', '运动员', '贵族',
           '保姆']

# 生成两个角色
character_list = [{
    "固定属性": {
        "ID": 1,
        "名字": '小红',
        "性别": '女性',
        "年龄": 16,
        "身高": 155,
        "体重": 50,
        "性格": ['善良', '乐观'],
        "喜好": ['音乐', '看书'],
        "不喜欢": ['无']},
    '现在状况': {
        "目的": '',
        "计划": [''],
        "口袋": [],
        "背包": ['无背包'],
        "金钱": 50,
        "自我认知": '普通人',
        "职业": '学生',
        "姿势": 0,
        "行动能力": 1},  # 0代表站着，1代表坐着，2代表躺着
    '身体属性': {
        "体力": 100,  # 行动、抗打击程度，60以下疲惫，30以下困倦
        "力气": 3,  # 行动能力、打击程度，0-10
        "心态": 100,
        "气势": 20,
        "颜值": 50,
        "反应力": 5,
        "罪恶度": 0,
        "疾病": ['无']},
    '外观': {
        "头戴": '',
        "嘴戴": '',
        "脖戴": '',
        "手戴": '',
        "身戴": '',
        "鞋穿": '黑色皮鞋',
        "发型": '双低马尾',
        "发长": 6,  # 0为光头，2为寸头，4为及胸，6为及腰，10为过膝
        "上衣": 'T恤',
        "下衣": '牛仔裤'}
},
    {
        "固定属性": {
            "ID": 2,
            "名字": '小明',
            "性别": '男性',
            "年龄": 25,
            "身高": 185,
            "体重": 75,
            "性格": ['阴狠', '易怒'],
            "喜好": ['睡觉'],
            "不喜欢": ['无']},
        '现在状况': {
            "目的": '',
            "计划": [''],
            "口袋": [],
            "背包": ['无背包'],
            "金钱": 300,
            "自我认知": '混混头子',
            "职业": '无',
            "姿势": 0,
            "行动能力": 1},
        '身体属性': {
            "体力": 100,
            "力气": 7,
            "心态": 100,
            "气势": 50,
            "颜值": 50,
            "反应力": 8,
            "罪恶度": 20,
            "疾病": ['无']},
        '外观': {
            "头戴": '',
            "嘴戴": '',
            "脖戴": '',
            "手戴": '',
            "身戴": '',
            "鞋穿": '深灰色皮鞋',
            "袜穿": '黑色短袜',
            "发型": '背头',
            "发长": 1,  # 0为光头，2为寸头，4为及胸，6为及腰，10为过膝
            "上衣": '白色T恤',
            "下衣": '深蓝色牛仔裤'}
    }
]
